# BoundaryDetectError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteImportFailures..::..BoundaryDetectError Property
BuiltInFailures..::..SiteImportFailures Class See Also
---
A boundary on this surface could not be autodetected. Revit will impose one, but it may be larger than you want.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BoundaryDetectError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryDetectError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BoundaryDetectError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteImportFailures Class
Autodesk.Revit.DB Namespace